In [1]:
import numpy  as np
import pandas as pd

import warnings
warnings.filterwarnings(action='ignore')

from datetime import date, datetime, timedelta
from dateutil.parser import parse

import json
import urllib

# titanic dataset
import seaborn as sns

# 비정형 데이터 처리를 위한 라이브러리
from bs4 import BeautifulSoup
import requests
import re



print('numpy  version - ' , np.__version__)
print('pandas version - ' , pd.__version__)

numpy  version -  1.20.3
pandas version -  1.3.4

In [2]:
def seriesInfo(s) :
    print('series : index + values \n' , s)
    print('index  - ' , s.index  , type(s.index))
    print('values - ' , s.values , type(s.values))

def frmInfo(df) :
    display('data - ' , df )
    print()
    print('shape   - ' , df.shape , df.shape[0] , df.shape[1])
    print('size    - ' , df.size )
    print('ndim    - ' , df.ndim)
    print('index   - ' , df.index    , type(df.index))
    print('columns - ' , df.columns  , type( df.columns ))
    print('values  - \n' , df.values , type(df.values) )

In [3]:
multi_col_idx_frm = pd.DataFrame( np.round( np.random.randn(5, 4) , 2 )    ,
                                  columns = [
                                      ['Grp01' , 'Grp01' , 'Grp02' , 'Grp02'] ,
                                      ['col01' , 'col02' , 'col03' , 'col04']
                                  ])

multi_col_idx_frm

  Grp01       Grp02
  col01 col02 col03 col04
0 -0.44  0.81 -1.79 -0.16
1 -1.09  0.43  0.62 -0.93
2 -2.26 -0.84 -1.16  0.67
3 -0.23 -0.19  0.48  0.77
4  1.79  0.22  0.52 -0.69

In [4]:
multi_col_idx_frm.columns

MultiIndex([('Grp01', 'col01'),
            ('Grp01', 'col02'),
            ('Grp02', 'col03'),
            ('Grp02', 'col04')],
           )

In [5]:
multi_col_idx_frm.columns.names = ['GrpIdx' , 'ColIdx' ]
multi_col_idx_frm

GrpIdx Grp01       Grp02
ColIdx col01 col02 col03 col04
0      -0.44  0.81 -1.79 -0.16
1      -1.09  0.43  0.62 -0.93
2      -2.26 -0.84 -1.16  0.67
3      -0.23 -0.19  0.48  0.77
4       1.79  0.22  0.52 -0.69

In [6]:
multi_col_idx_frm.columns.names

FrozenList(['GrpIdx', 'ColIdx'])

In [7]:
multi_idx_frm = pd.DataFrame( np.round( np.random.randn(6, 4) , 2 )    ,
                                  columns = [
                                      ['Grp01' , 'Grp01' , 'Grp02' , 'Grp02'] ,
                                      ['col01' , 'col02' , 'col03' , 'col04']
                                  ] ,
                                  index = [
                                      ['M' , 'M' , 'M' , 'F' , 'F' , 'F'] ,
                                      [ 'id_' + str(idx) for idx in range(6) ]
                                  ])

multi_idx_frm.columns.names = ['GrpIdx'  , 'ColIdx' ]
multi_idx_frm.index.names   = ['GenderIdx' , 'RowIdx' ]
multi_idx_frm

GrpIdx           Grp01       Grp02
ColIdx           col01 col02 col03 col04
GenderIdx RowIdx
M         id_0   -0.88  0.87 -0.62  0.64
          id_1   -0.79 -0.49  1.27  0.30
          id_2   -0.21  0.60 -0.04  0.72
F         id_3    0.60 -1.17 -1.13 -0.18
          id_4    0.73 -0.72  0.97 -0.33
          id_5    0.44 -0.22  1.62 -0.72

In [8]:
multi_idx_frm.stack()

GrpIdx                   Grp01  Grp02
GenderIdx RowIdx ColIdx
M         id_0   col01   -0.88    NaN
                 col02    0.87    NaN
                 col03     NaN  -0.62
                 col04     NaN   0.64
          id_1   col01   -0.79    NaN
                 col02   -0.49    NaN
                 col03     NaN   1.27
                 col04     NaN   0.30
          id_2   col01   -0.21    NaN
                 col02    0.60    NaN
                 col03     NaN  -0.04
                 col04     NaN   0.72
F         id_3   col01    0.60    NaN
                 col02   -1.17    NaN
                 col03     NaN  -1.13
                 col04     NaN  -0.18
          id_4   col01    0.73    NaN
                 col02   -0.72    NaN
                 col03     NaN   0.97
                 col04     NaN  -0.33
          id_5   col01    0.44    NaN
                 col02   -0.22    NaN
                 col03     NaN   1.62
                 col04     NaN  -0.72

In [9]:
multi_idx_frm.stack('GrpIdx')

ColIdx                   col01  col02  col03  col04
GenderIdx RowIdx GrpIdx
M         id_0   Grp01   -0.88   0.87    NaN    NaN
                 Grp02     NaN    NaN  -0.62   0.64
          id_1   Grp01   -0.79  -0.49    NaN    NaN
                 Grp02     NaN    NaN   1.27   0.30
          id_2   Grp01   -0.21   0.60    NaN    NaN
                 Grp02     NaN    NaN  -0.04   0.72
F         id_3   Grp01    0.60  -1.17    NaN    NaN
                 Grp02     NaN    NaN  -1.13  -0.18
          id_4   Grp01    0.73  -0.72    NaN    NaN
                 Grp02     NaN    NaN   0.97  -0.33
          id_5   Grp01    0.44  -0.22    NaN    NaN
                 Grp02     NaN    NaN   1.62  -0.72

In [10]:
multi_idx_frm.unstack()

GrpIdx    Grp01                                                      ...  \
ColIdx    col01                              col02                   ...
RowIdx     id_0  id_1  id_2 id_3  id_4  id_5  id_0  id_1 id_2  id_3  ...
GenderIdx                                                            ...
F           NaN   NaN   NaN  0.6  0.73  0.44   NaN   NaN  NaN -1.17  ...
M         -0.88 -0.79 -0.21  NaN   NaN   NaN  0.87 -0.49  0.6   NaN  ...

GrpIdx    Grp02
ColIdx    col03                   col04
RowIdx     id_2  id_3  id_4  id_5  id_0 id_1  id_2  id_3  id_4  id_5
GenderIdx
F           NaN -1.13  0.97  1.62   NaN  NaN   NaN -0.18 -0.33 -0.72
M         -0.04   NaN   NaN   NaN  0.64  0.3  0.72   NaN   NaN   NaN

[2 rows x 24 columns]

In [11]:
multi_idx_frm.unstack('GenderIdx')

GrpIdx    Grp01                   Grp02
ColIdx    col01       col02       col03       col04
GenderIdx     F     M     F     M     F     M     F     M
RowIdx
id_0        NaN -0.88   NaN  0.87   NaN -0.62   NaN  0.64
id_1        NaN -0.79   NaN -0.49   NaN  1.27   NaN  0.30
id_2        NaN -0.21   NaN  0.60   NaN -0.04   NaN  0.72
id_3       0.60   NaN -1.17   NaN -1.13   NaN -0.18   NaN
id_4       0.73   NaN -0.72   NaN  0.97   NaN -0.33   NaN
id_5       0.44   NaN -0.22   NaN  1.62   NaN -0.72   NaN

In [12]:

multi_idx_frm[ [ ('Grp01', 'col01') , ('Grp01', 'col02') ] ]

GrpIdx           Grp01
ColIdx           col01 col02
GenderIdx RowIdx
M         id_0   -0.88  0.87
          id_1   -0.79 -0.49
          id_2   -0.21  0.60
F         id_3    0.60 -1.17
          id_4    0.73 -0.72
          id_5    0.44 -0.22

In [13]:
multi_idx_frm

GrpIdx           Grp01       Grp02
ColIdx           col01 col02 col03 col04
GenderIdx RowIdx
M         id_0   -0.88  0.87 -0.62  0.64
          id_1   -0.79 -0.49  1.27  0.30
          id_2   -0.21  0.60 -0.04  0.72
F         id_3    0.60 -1.17 -1.13 -0.18
          id_4    0.73 -0.72  0.97 -0.33
          id_5    0.44 -0.22  1.62 -0.72

In [14]:
multi_idx_frm[('Grp02','col03')].values[0]

-0.62

In [15]:
multi_idx_frm.loc[('M', 'id_1'), 'Grp02']
multi_idx_frm['Grp02'].values[1]
multi_idx_frm[ ('Grp02','col03') ]  [('M','id_2')]

-0.04

In [16]:
multi_idx_frm[[('Grp02','col03'),('Grp02','col04')]].iloc[1].values

array([1.27, 0.3 ])

In [17]:
print('M 정보만 출력 - ')

multi_idx_frm.loc['M']
multi_idx_frm.iloc[ : 3 , 2 : 4  ]

M 정보만 출력 -

GrpIdx           Grp02
ColIdx           col03 col04
GenderIdx RowIdx
M         id_0   -0.62  0.64
          id_1    1.27  0.30
          id_2   -0.04  0.72

In [18]:
multi_idx_frm

GrpIdx           Grp01       Grp02
ColIdx           col01 col02 col03 col04
GenderIdx RowIdx
M         id_0   -0.88  0.87 -0.62  0.64
          id_1   -0.79 -0.49  1.27  0.30
          id_2   -0.21  0.60 -0.04  0.72
F         id_3    0.60 -1.17 -1.13 -0.18
          id_4    0.73 -0.72  0.97 -0.33
          id_5    0.44 -0.22  1.62 -0.72

In [19]:
multi_idx_frm.sort_index(level = 1 , axis = 1)

GrpIdx           Grp01       Grp02
ColIdx           col01 col02 col03 col04
GenderIdx RowIdx
M         id_0   -0.88  0.87 -0.62  0.64
          id_1   -0.79 -0.49  1.27  0.30
          id_2   -0.21  0.60 -0.04  0.72
F         id_3    0.60 -1.17 -1.13 -0.18
          id_4    0.73 -0.72  0.97 -0.33
          id_5    0.44 -0.22  1.62 -0.72

In [20]:
grp_frm = pd.DataFrame({
    '학과' : ['인공지능' , '데이터분석' , '인공지능' , '데이터분석' , '데이터분석'] ,
    '학년' : [1, 2, 3, 4, 2] ,
    '이름' : ['Jason' , 'Kiki' , 'Alan' , 'Zi' , 'Rosa'] ,
    '학점' : [2.7, 3.5, 4.5, 3.8, 4.3]
})

grp_frm

      학과  학년     이름   학점
0   인공지능   1  Jason  2.7
1  데이터분석   2   Kiki  3.5
2   인공지능   3   Alan  4.5
3  데이터분석   4     Zi  3.8
4  데이터분석   2   Rosa  4.3

In [21]:
print('그룹을 만드는 방법은 두가지로 데이터프레임그룹 과 시리즈그룹이 생성될 수 있다. - ')
dept_frm = grp_frm.groupby( grp_frm['학과'])
print('프레임 그룹 - ' , dept_frm )

dept_series = grp_frm['학과'].groupby( grp_frm['학과'])
print('프레임 그룹 - ' , dept_series )

그룹을 만드는 방법은 두가지로 데이터프레임그룹 과 시리즈그룹이 생성될 수 있다. -
프레임 그룹 -  <pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f90b871e880>
프레임 그룹 -  <pandas.core.groupby.generic.SeriesGroupBy object at 0x7f90b871e430>

In [22]:
print('그룹 정보 확인 - ')
print('groups - ' ,  dept_series.groups )
print()
print('그룹 정보를 가져오고 싶다면 - ')
print(dept_series.get_group('데이터분석') )
print()
print(dept_series.get_group('인공지능') )

그룹 정보 확인 -
groups -  {'데이터분석': [1, 3, 4], '인공지능': [0, 2]}

그룹 정보를 가져오고 싶다면 -
1    데이터분석
3    데이터분석
4    데이터분석
Name: 학과, dtype: object

0    인공지능
2    인공지능
Name: 학과, dtype: object

In [23]:
print('데이터프레임 그룹 - ')

print('그룹 정보 확인 - ')
print('groups - ' ,  dept_frm.groups )
print()
print('그룹 정보를 가져오고 싶다면 - ')
display(dept_frm.get_group('데이터분석') )
print()
display(dept_frm.get_group('인공지능') )

데이터프레임 그룹 -
그룹 정보 확인 -
groups -  {'데이터분석': [1, 3, 4], '인공지능': [0, 2]}

그룹 정보를 가져오고 싶다면 -

      학과  학년    이름   학점
1  데이터분석   2  Kiki  3.5
3  데이터분석   4    Zi  3.8
4  데이터분석   2  Rosa  4.3

     학과  학년     이름   학점
0  인공지능   1  Jason  2.7
2  인공지능   3   Alan  4.5

In [24]:
dept_frm.describe()

         학년                                                 학점            \
      count      mean       std  min  25%  50%  75%  max count      mean
학과
데이터분석   3.0  2.666667  1.154701  2.0  2.0  2.0  3.0  4.0   3.0  3.866667
인공지능    2.0  2.000000  1.414214  1.0  1.5  2.0  2.5  3.0   2.0  3.600000


            std  min   25%  50%   75%  max
학과
데이터분석  0.404145  3.5  3.65  3.8  4.05  4.3
인공지능   1.272792  2.7  3.15  3.6  4.05  4.5

In [25]:
print('학과별 학점 평균만 출력한다면 - ')
# dept_frm.mean()
print('case01 - ')
display( grp_frm['학점'].groupby(grp_frm['학과']).mean() )
print()
print('case02 - ')
print( grp_frm.groupby(grp_frm['학과'])['학점'].mean() )
print()
print('case03 - ')
print( grp_frm.groupby(grp_frm['학과']).mean()['학점'] )

학과별 학점 평균만 출력한다면 -
case01 -

학과
데이터분석    3.866667
인공지능     3.600000
Name: 학점, dtype: float64

case02 -
학과
데이터분석    3.866667
인공지능     3.600000
Name: 학점, dtype: float64

case03 -
학과
데이터분석    3.866667
인공지능     3.600000
Name: 학점, dtype: float64

In [26]:
dept_frm.sum()

       학년    학점
학과
데이터분석   8  11.6
인공지능    4   7.2

In [27]:
dept_frm.agg( [np.mean , np.sum] )

             학년            학점
           mean sum      mean   sum
학과
데이터분석  2.666667   8  3.866667  11.6
인공지능   2.000000   4  3.600000   7.2

In [28]:
grp_frm

      학과  학년     이름   학점
0   인공지능   1  Jason  2.7
1  데이터분석   2   Kiki  3.5
2   인공지능   3   Alan  4.5
3  데이터분석   4     Zi  3.8
4  데이터분석   2   Rosa  4.3

In [29]:
print('다중 그룹 - ')

multi_grp_frm = grp_frm.groupby(['학과' , '학년'])

print('그룹 정보 확인 - ')
print('groups - ' ,  multi_grp_frm.groups )

다중 그룹 -
그룹 정보 확인 -
groups -  {('데이터분석', 2): [1, 4], ('데이터분석', 4): [3], ('인공지능', 1): [0], ('인공지능', 3): [2]}

In [30]:
tmp_frm = pd.DataFrame({
    'idx01' : ['A' , 'A' , 'B' , 'B' , 'A'] ,
    'idx02' : ['one' , 'two' , 'one' , 'two' , 'one'] ,
    'idx01_data01' : [1, 2, 3, 4, 5] ,
    'idx02_data02' : [10, 20, 30, 40, 50] ,
})

tmp_frm

  idx01 idx02  idx01_data01  idx02_data02
0     A   one             1            10
1     A   two             2            20
2     B   one             3            30
3     B   two             4            40
4     A   one             5            50

In [31]:
print('idx01 그룹을 만들고 싶다면 - ')
idx01_grp = tmp_frm.groupby(tmp_frm['idx01'])
idx01_grp.groups

idx01 그룹을 만들고 싶다면 -

{'A': [0, 1, 4], 'B': [2, 3]}

In [32]:
print('idx01 그룹을 만들고 싶다면 - ')
idx01_grp = tmp_frm.groupby(tmp_frm['idx01'])
idx01_grp.groups

idx01 그룹을 만들고 싶다면 -

{'A': [0, 1, 4], 'B': [2, 3]}

In [33]:
print('그룹에 대한 수치값들만 그룹 연산이 된다 - ')
idx01_grp.sum()

그룹에 대한 수치값들만 그룹 연산이 된다 -

       idx01_data01  idx02_data02
idx01
A                 8            80
B                 7            70

In [34]:
tmp_frm['idx01_data01'].groupby(tmp_frm['idx01']).mean()

idx01
A    2.666667
B    3.500000
Name: idx01_data01, dtype: float64

In [35]:
print('다중 키 또는 복합 키 - ')
tmp_frm['idx01_data01'].groupby([tmp_frm['idx01'] , tmp_frm['idx02']]).sum().unstack()

다중 키 또는 복합 키 -

idx02  one  two
idx01
A        6    2
B        3    4

In [37]:
titanic_dataset = sns.load_dataset('titanic')
iris_dataset = sns.load_dataset('iris')

In [39]:
titanic_dataset
iris_dataset

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [40]:
print('age, sex, class, fare, survived - 순서로 서브셋 구축')

subset = titanic_dataset[['age','sex','class','fare','survived']]
subset

age, sex, class, fare, survived - 순서로 서브셋 구축

      age     sex   class     fare  survived
0    22.0    male   Third   7.2500         0
1    38.0  female   First  71.2833         1
2    26.0  female   Third   7.9250         1
3    35.0  female   First  53.1000         1
4    35.0    male   Third   8.0500         0
..    ...     ...     ...      ...       ...
886  27.0    male  Second  13.0000         0
887  19.0  female   First  30.0000         1
888   NaN  female   Third  23.4500         0
889  26.0    male   First  30.0000         1
890  32.0    male   Third   7.7500         0

[891 rows x 5 columns]

In [42]:
subset = titanic_dataset.loc[ : , ['age','sex','class','fare','survived']]
print('case 2-', subset)

case 2-       age     sex   class     fare  survived
0    22.0    male   Third   7.2500         0
1    38.0  female   First  71.2833         1
2    26.0  female   Third   7.9250         1
3    35.0  female   First  53.1000         1
4    35.0    male   Third   8.0500         0
..    ...     ...     ...      ...       ...
886  27.0    male  Second  13.0000         0
887  19.0  female   First  30.0000         1
888   NaN  female   Third  23.4500         0
889  26.0    male   First  30.0000         1
890  32.0    male   Third   7.7500         0

[891 rows x 5 columns]

In [43]:
print('요구사항 - 선실등급에 따른 그룹을 생성한다면 ')
class_grp = subset.groupby(subset['class'])

for grp_id  , data in class_grp :
    print('grp_id - ' , grp_id)
    print()
    print(data)

요구사항 - 선실등급에 따른 그룹을 생성한다면
grp_id -  First

      age     sex  class     fare  survived
1    38.0  female  First  71.2833         1
3    35.0  female  First  53.1000         1
6    54.0    male  First  51.8625         0
11   58.0  female  First  26.5500         1
23   28.0    male  First  35.5000         1
..    ...     ...    ...      ...       ...
871  47.0  female  First  52.5542         1
872  33.0    male  First   5.0000         0
879  56.0  female  First  83.1583         1
887  19.0  female  First  30.0000         1
889  26.0    male  First  30.0000         1

[216 rows x 5 columns]
grp_id -  Second

      age     sex   class     fare  survived
9    14.0  female  Second  30.0708         1
15   55.0  female  Second  16.0000         1
17    NaN    male  Second  13.0000         1
20   35.0    male  Second  26.0000         0
21   34.0    male  Second  13.0000         1
..    ...     ...     ...      ...       ...
866  27.0  female  Second  13.8583         1
874  28.0  female  Second  24.0000         1
880  25.0  female  Second  26.0000         1
883  28.0    male  Second  10.5000         0
886  27.0    male  Second  13.0000         0

[184 rows x 5 columns]
grp_id -  Third

      age     sex  class     fare  survived
0    22.0    male  Third   7.2500         0
2    26.0  female  Third   7.9250         1
4    35.0    male  Third   8.0500         0
5     NaN    male  Third   8.4583         0
7     2.0    male  Third  21.0750         0
..    ...     ...    ...      ...       ...
882  22.0  female  Third  10.5167         0
884  25.0    male  Third   7.0500         0
885  39.0  female  Third  29.1250         0
888   NaN  female  Third  23.4500         0
890  32.0    male  Third   7.7500         0

[491 rows x 5 columns]